DemoRequests/demoManageGetOrdersBySellerIdRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ord="http://www.wstutorial.com/ws/OrderService">
   <soapenv:Header/>
   <soapenv:Body>
      <ord:getOrdersBySellerIdRequest>
         <sellerId>201</sellerId>
      </ord:getOrdersBySellerIdRequest>
   </soapenv:Body>
</soapenv:Envelope>